Revit 2024 API
CompoundStructure.StructuralMaterialIndex Property
 Indicates the layer whose material defines the structural properties of the type for the purposes of analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int StructuralMaterialIndex { get; set; }
Visual Basic
Public Property StructuralMaterialIndex As Integer
	Get
	Set
Visual C++
public:
property int StructuralMaterialIndex {
	int get ();
	void set (int value);
}
Field Value
 The index of the layer containing the structural material properties.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The specified layer cannot define the structural material properties of the type.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The layer index is invalid.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace